In [65]:
import pandas as pd
import numpy as np

In [26]:
df= pd.read_csv("/content/enronClean.csv")
df['TIMESTAMP'] = pd.to_datetime(df['TIMESTAMP'])

<ipython-input-26-309f00bd5bad>:2: FutureWarning: In a future version of pandas, parsing datetimes with mixed time zones will raise an error unless `utc=True`. Please specify `utc=True` to opt in to the new behaviour and silence this warning. To create a `Series` with mixed offsets and `object` dtype, please use `apply` and `datetime.datetime.strptime`
  df['TIMESTAMP'] = pd.to_datetime(df['TIMESTAMP'])

In [37]:
df['TIMESTAMP'] = pd.to_datetime(df['TIMESTAMP'], errors='coerce')

In [40]:
df.shape[0]
#1

526390

In [41]:
df['FROM'].nunique()
#2

7533

In [42]:
df['FROM'].value_counts().head(5)
#3

FROM
jae.black@enron.com            48966
veronica.espinoza@enron.com    31576
pete.davis@enron.com           23016
technology.enron@enron.com     21716
l..denton@enron.com            11555
Name: count, dtype: int64

In [43]:
df['TYPE'].value_counts()
#4

TYPE
TO      407500
BCC      60370
CC       58447
TO"         52
BCC"        14
CC"          7
Name: count, dtype: int64

In [44]:
df.groupby(df['TIMESTAMP'].dt.date).size()
#5

TIMESTAMP
2001-09-30      461
2001-10-01     6406
2001-10-02     3623
2001-10-03     2679
2001-10-04     3287
2001-10-05     6324
2001-10-06      678
2001-10-07      757
2001-10-08     6856
2001-10-09     5340
2001-10-10     6324
2001-10-11     5825
2001-10-12     8905
2001-10-13      741
2001-10-14     1234
2001-10-15    12216
2001-10-16     9515
2001-10-17    18603
2001-10-18    23934
2001-10-19    13861
2001-10-20      910
2001-10-21     1078
2001-10-22    23839
2001-10-23    19237
2001-10-24    16853
2001-10-25    14609
2001-10-26    12581
2001-10-27     1022
2001-10-28       30
dtype: int64

In [45]:
df.groupby(df['TIMESTAMP'].dt.date).size().mean()
#6

np.float64(7852.689655172414)

In [46]:
df['SUBJECT'].value_counts()[df['SUBJECT'].value_counts() > 1]
#7

SUBJECT
"Enron Center South Technology Watch"                                    21716
"Credit Watch List--Week of 11/19/01"                                     7680
""                                                                        7384
"Credit Watch List--Week of 10/29/01"                                     7104
"Credit Watch List--Week of 10/22/01"                                     6460
                                                                         ...
"Enron and Prediction Company"                                               2
"FW: REGT Capacity Report Thursday November 8"                               2
"exp dates"                                                                  2
"FW: Commodities Futures and Swaps Contracts: Set-Off and Bankruptcy"        2
"NYISO - Holiday Office Hours"                                               2
Name: count, Length: 19716, dtype: int64

In [47]:
df[df['TO'].str.contains(',', na=False)].shape[0]
#8

0

In [48]:
df['TIMESTAMP'].dt.hour.value_counts().idxmax()
#9

np.float64(8.0)

In [49]:
df[df['TO'].str.contains('enron.com', na=False)]['FROM'].value_counts()
#10

FROM
jae.black@enron.com                                      48966
veronica.espinoza@enron.com                              31576
pete.davis@enron.com                                     23016
technology.enron@enron.com                               21716
l..denton@enron.com                                      11555
                                                         ...
ying_chan99@hotmail.com                                      1
fricciuti@dceg.com                                           1
reminder@myfamilyinc.com                                     1
21f382737e8311a74bca1df39e574bcbd0c@tm02.com                 1
circuitcity.com_031465@circuitcity.customer-email.com        1
Name: count, Length: 6644, dtype: int64

In [50]:
df['TIMESTAMP'].min(), df['TIMESTAMP'].max()
#11

(Timestamp('2001-09-30 16:19:46-0700', tz='UTC-07:00'),
 Timestamp('2001-10-28 01:55:08-0700', tz='UTC-07:00'))

In [51]:
df['FROM'].value_counts()[df['FROM'].value_counts() > 100]
#12

FROM
jae.black@enron.com                48966
veronica.espinoza@enron.com        31576
pete.davis@enron.com               23016
technology.enron@enron.com         21716
l..denton@enron.com                11555
                                   ...
tom.moran@enron.com                  102
jschilke@ix.netcom.com               102
alumni.office@anderson.ucla.edu      102
amanda.schultz@enron.com             101
john.suarez@enron.com                101
Name: count, Length: 629, dtype: int64

In [52]:
df['SUBJECT'].str.lower().str.contains('meeting', na=False).sum()
#13

np.int64(32789)

In [53]:
df_exploded = df.copy()
df_exploded['TO'] = df_exploded['TO'].fillna('').str.split(',')
df_exploded = df_exploded.explode('TO')
df_exploded['TO'].str.strip().value_counts().head(1)
#14

TO
pete.davis@enron.com    3301
Name: count, dtype: int64

In [54]:
df[df['TIMESTAMP'].dt.hour.between(9, 18)].shape[0]
#15

140128

In [55]:
df.groupby(df['TIMESTAMP'].dt.date).size().nlargest(3)
#16

TIMESTAMP
2001-10-18    23934
2001-10-22    23839
2001-10-23    19237
dtype: int64

In [56]:
empty_subjects = df['SUBJECT'].isna().sum() + (df['SUBJECT'] == '').sum()
empty_subjects / len(df)
#17

np.float64(0.0)

In [57]:
df['FROM'].value_counts().mean()#18

np.float64(69.87787070224346)

In [60]:
df.groupby('FROM')['SUBJECT'].nunique().sort_values(ascending=False)#19

FROM
pete.davis@enron.com          922
d..steffes@enron.com          678
jeff.dasovich@enron.com       496
louise.kitchen@enron.com      431
rod.hayslett@enron.com        391
                             ...
zaiontj@bp.com                  1
zagatsurvey@news.zagat.com      1
zack.starbird@mirant.com        1
zachary.streight@enron.com      1
zachary.allen@enron.com         1
Name: SUBJECT, Length: 7533, dtype: int64

In [66]:
emails_per_user = df['FROM'].value_counts()
np.std(emails_per_user)
#20

829.2273593489443

In [67]:
email_counts = df['FROM'].value_counts().to_numpy()
np.median(email_counts)
#21

np.float64(3.0)

In [68]:
emails_per_user = df['FROM'].value_counts()
np.std(emails_per_user)
#22

829.2273593489443

In [59]:
df['MID'].nunique()
#23

64755